<a href="https://colab.research.google.com/github/nandakumar92/datacamp/blob/main/Reshaping_Data_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [22]:
titles=pd.read_csv('/content/drive/MyDrive/Colab/Data/netflix/netflix_titles.csv')

In [23]:
titles.head(5)

  show_id  ...                                        description
0      s1  ...  In a future where the elite inhabit an island ...
1      s2  ...  After a devastating earthquake hits Mexico Cit...
2      s3  ...  When an army recruit is found dead, his fellow...
3      s4  ...  In a postapocalyptic world, rag-doll robots hi...
4      s5  ...  A brilliant group of students become card-coun...

[5 rows x 12 columns]

In [31]:
## pivot can be used to reshape data into desired index and columns
titles.pivot(index='title',columns='type',values='duration')
#titles[(titles.country=='United States') & (titles.type=='Movie')].sort_values(by='duration')

type                             Movie    TV Show
title
#Alive                          99 min        NaN
#AnneFrank - Parallel Stories   95 min        NaN
#FriendButMarried              102 min        NaN
#FriendButMarried 2            104 min        NaN
#Roxy                          105 min        NaN
...                                ...        ...
忍者ハットリくん                           NaN  2 Seasons
海的儿子                               NaN   1 Season
마녀사냥                               NaN   1 Season
반드시 잡는다                        110 min        NaN
최강전사 미니특공대 : 영웅의 탄생             68 min        NaN

[7787 rows x 2 columns]

In [33]:
## multiple values
titles.pivot(index='title',columns='type',values=['duration','release_year'])

                              duration            release_year
type                             Movie    TV Show        Movie TV Show
title
#Alive                          99 min        NaN         2020     NaN
#AnneFrank - Parallel Stories   95 min        NaN         2019     NaN
#FriendButMarried              102 min        NaN         2018     NaN
#FriendButMarried 2            104 min        NaN         2020     NaN
#Roxy                          105 min        NaN         2018     NaN
...                                ...        ...          ...     ...
忍者ハットリくん                           NaN  2 Seasons          NaN    2012
海的儿子                               NaN   1 Season          NaN    2016
마녀사냥                               NaN   1 Season          NaN    2015
반드시 잡는다                        110 min        NaN         2017     NaN
최강전사 미니특공대 : 영웅의 탄생             68 min        NaN         2018     NaN

[7787 rows x 4 columns]

In [40]:
## using pivot will only work if the combination is unique. Pivot table can be used in case of duplicates and use aggregates
cards=pd.read_csv('/content/drive/MyDrive/Colab/Data/credit_card_customers/BankChurners.csv')
cards.head(2)

   CLIENTNUM  ... Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_2
0  768805383  ...                                            0.99991
1  818770008  ...                                            0.99994

[2 rows x 23 columns]

In [42]:
df=cards.pivot_table(index='Gender',columns='Education_Level',values='Total_Revolving_Bal',aggfunc='sum')

In [47]:
df.head(2)

Education_Level  College  Doctorate  ...  Uneducated  Unknown
Gender                               ...
F                 608168     280068  ...      893243   886007
M                 542381     213364  ...      822873   876716

[2 rows x 7 columns]

In [51]:
## selecting indexes from pivot tables
df[df.index=='F']

Education_Level  College  Doctorate  ...  Uneducated  Unknown
Gender                               ...
F                 608168     280068  ...      893243   886007

[1 rows x 7 columns]

In [55]:
## selecting columns from pivot tables
df[['Doctorate','College']]

Education_Level  Doctorate  College
Gender
F                   280068   608168
M                   213364   542381

In [59]:
## selecting values from pivot tables
df[df.College<608168]

Education_Level  College  Doctorate  ...  Uneducated  Unknown
Gender                               ...
M                 542381     213364  ...      822873   876716

[1 rows x 7 columns]

In [62]:
## converting data between wide and long formats using melt
books=pd.read_csv('/content/drive/MyDrive/Colab/Data/reshaping data with pandas/books.csv', error_bad_lines=False)
books.head(2)

b'Skipping line 3350: expected 12 fields, saw 13\nSkipping line 4704: expected 12 fields, saw 13\nSkipping line 5879: expected 12 fields, saw 13\nSkipping line 8981: expected 12 fields, saw 13\n'

   bookID  ...        publisher
0       1  ...  Scholastic Inc.
1       2  ...  Scholastic Inc.

[2 rows x 12 columns]

In [67]:
## converting wide to long format with repeating columns and variable column
books.melt(id_vars='title')

                                                    title  ...          value
0       Harry Potter and the Half-Blood Prince (Harry ...  ...              1
1       Harry Potter and the Order of the Phoenix (Har...  ...              2
2       Harry Potter and the Chamber of Secrets (Harry...  ...              4
3       Harry Potter and the Prisoner of Azkaban (Harr...  ...              5
4       Harry Potter Boxed Set  Books 1-5 (Harry Potte...  ...              8
...                                                   ...  ...            ...
122348   Expelled from Eden: A William T. Vollmann Reader  ...  Da Capo Press
122349                        You Bright and Risen Angels  ...  Penguin Books
122350                    The Ice-Shirt (Seven Dreams #1)  ...  Penguin Books
122351                                        Poor People  ...           Ecco
122352                        Las aventuras de Tom Sawyer  ...  Edimat Libros

[122353 rows x 3 columns]

In [70]:
## selecting columns needed in variable.
books.melt(id_vars='title',value_name='value',var_name='feature',value_vars=['ratings_count','text_reviews_count'])

                                                   title  ...    value
0      Harry Potter and the Half-Blood Prince (Harry ...  ...  2095690
1      Harry Potter and the Order of the Phoenix (Har...  ...  2153167
2      Harry Potter and the Chamber of Secrets (Harry...  ...     6333
3      Harry Potter and the Prisoner of Azkaban (Harr...  ...  2339585
4      Harry Potter Boxed Set  Books 1-5 (Harry Potte...  ...    41428
...                                                  ...  ...      ...
22241   Expelled from Eden: A William T. Vollmann Reader  ...       20
22242                        You Bright and Risen Angels  ...       56
22243                    The Ice-Shirt (Seven Dreams #1)  ...       95
22244                                        Poor People  ...      139
22245                        Las aventuras de Tom Sawyer  ...       12

[22246 rows x 3 columns]

In [71]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11123 entries, 0 to 11122
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   bookID              11123 non-null  int64
 1   title               11123 non-null  object
 2   authors             11123 non-null  object
 3   average_rating      11123 non-null  float64
 4   isbn                11123 non-null  object
 5   isbn13              11123 non-null  int64
 6   language_code       11123 non-null  object
 7     num_pages         11123 non-null  int64
 8   ratings_count       11123 non-null  int64
 9   text_reviews_count  11123 non-null  int64
 10  publication_date    11123 non-null  object
 11  publisher           11123 non-null  object
dtypes: float64(1), int64(5), object(6)
memory usage: 1.0+ MB

In [74]:
## stacking dataframes takes columns and converts to index rows

df_single_level_cols = pd.DataFrame([[0, 1], [2, 3]],
                                    index=['cat', 'dog'],
                                    columns=['weight', 'height'])

df_single_level_cols.stack()

cat  weight    0
     height    1
dog  weight    2
     height    3
dtype: int64

In [75]:
## stacking is useful in case of multi level indexes
header = pd.MultiIndex.from_product([['Semester1','Semester2'],['Maths','Science']])
d=([[12,45,67,56],[78,89,45,67],[45,67,89,90],[67,44,56,55]])


df = pd.DataFrame(d,
                  index=['Alisa','Bobby','Cathrine','Jack'],
                  columns=header)
df

         Semester1         Semester2
             Maths Science     Maths Science
Alisa           12      45        67      56
Bobby           78      89        45      67
Cathrine        45      67        89      90
Jack            67      44        56      55

In [78]:
stacked_df=df.stack()

In [79]:
stacked_df

                  Semester1  Semester2
Alisa    Maths           12         67
         Science         45         56
Bobby    Maths           78         45
         Science         89         67
Cathrine Maths           45         89
         Science         67         90
Jack     Maths           67         56
         Science         44         55

In [80]:
stacked_df.unstack()

         Semester1         Semester2
             Maths Science     Maths Science
Alisa           12      45        67      56
Bobby           78      89        45      67
Cathrine        45      67        89      90
Jack            67      44        56      55

In [81]:
### stacking at level 0 column index
stacked_df_lvl=df.stack(level=0)
stacked_df_lvl

                    Maths  Science
Alisa    Semester1     12       45
         Semester2     67       56
Bobby    Semester1     78       89
         Semester2     45       67
Cathrine Semester1     45       67
         Semester2     89       90
Jack     Semester1     67       44
         Semester2     56       55

In [82]:
stacked_df_lvl.unstack()

             Maths             Science
         Semester1 Semester2 Semester1 Semester2
Alisa           12        67        45        56
Bobby           78        45        89        67
Cathrine        45        89        67        90
Jack            67        56        44        55